src/cf/Enums/ТипыПодписиКриптографии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыПодписиКриптографии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESBES</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdEST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLong</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLongType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLongType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESAv2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESAv3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПодписиКриптографии/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.CAdESBES);
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.CAdEST);
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.CAdESAv3);
	
	ДанныеВыбора = СписокЗначений;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
